#+STARTUP: overview
#+TITLE: Taymacs 
#+CREATOR: Taylor Hardy
#+LANGUAGE: en
#+OPTIONS: num:nil
#+ATTR_HTML: :style margin-left: auto; margin-right: auto;

** rcirc
#+BEGIN_SRC emacs-lisp
(setq rcirc-default-nick "nobodynogroup")
(setq rcirc-server-alist
      '(("irc.freenode.net" :port 6697 :encryption tls
	 :channels ("#rcirc" "#emacs" "#emacswiki"))))

#+END_SRC

#+RESULTS:
| irc.freenode.net | :port | 6697 | :encryption | tls | :channels | (#rcirc #emacs #emacswiki) |


